src/InformationRegisters/ОтветственныеПоПодсисетмам/ОтветственныеПоПодсисетмам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеПоПодсисетмам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Подсистема</name>
    <type>
      <types>CatalogRef.Подсистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтветственныеПоПодсисетмам/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНовыеПодсистемы(Команда)
	
	//ПараметрыДобавления = Новый Структура("Конфигурация, Ответственный");
	//ОповещениеВыбораКонфигурации = Новый ОписаниеОповещения("ДобавитьНовыеПодсистемы_ВыборКонфигурации", ЭтаФорма, ПараметрыДобавления);
	//ОткрытьФорму("Справочник.Конфигурации.ФормаВыбора",, ЭтаФорма,,,, ОповещениеВыбораКонфигурации, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	ОповещениеВыбораПараметров = Новый ОписаниеОповещения("ДобавитьНовыеПодсистемы_Продолжение", ЭтаФорма);
	ОткрытьФорму(
		"РегистрСведений.ОтветственныеПоПодсисетмам.Форма.ФормаВыбораПараметровДобавления"
		,
		,
		ЭтаФорма,
		,
		,
		,
		ОповещениеВыбораПараметров,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаКлиенте
//Процедура ДобавитьНовыеПодсистемы_ВыборКонфигурации(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДополнительныеПараметры.Конфигуарция = Результат;
//	
//	ОповещениеВыбораОтветственного = Новый ОписаниеОповещения("ДобавитьНовыеПодсистемы_ВыборКонфигурации", ЭтаФорма, ПараметрыДобавления);
//	ОткрытьФорму("Справочник.Конфигурации.ФормаВыбора",, ЭтаФорма,,,, ОповещениеВыбораКонфигурации, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДобавитьНовыеПодсистемы_ВыборОтветственного() Экспорт
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеПодсистемы_Продолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьНовыеПодсистемыНаСервере(Результат.Конфигурация, Результат.Ответственный);
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ОтветственныеПоПодсисетмам"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьНовыеПодсистемыНаСервере(Конфигурация, Ответственный)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подсистемы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВсеПодсистемыКонфигурации
		|ИЗ
		|	Справочник.Подсистемы КАК Подсистемы
		|ГДЕ
		|	Подсистемы.Владелец = &Конфигурация
		|	И НЕ Подсистемы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеПодсистемыКонфигурации.Ссылка КАК Подсистема
		|ИЗ
		|	ВсеПодсистемыКонфигурации КАК ВсеПодсистемыКонфигурации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеПоПодсисетмам КАК ОтветственныеПоПодсисетмам
		|		ПО ВсеПодсистемыКонфигурации.Ссылка = ОтветственныеПоПодсисетмам.Подсистема
		|ГДЕ
		|	ОтветственныеПоПодсисетмам.Подсистема ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПериодЗаписи = ТекущаяДата();
	Набор = РегистрыСведений.ОтветственныеПоПодсисетмам.СоздатьНаборЗаписей();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = Набор.Добавить();
		Запись.Период = ПериодЗаписи;
		Запись.Подсистема = ВыборкаДетальныеЗаписи.Подсистема;
		Запись.Ответственный = Ответственный;
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти
